{
    "hello": "Hello",
    "goodbye": "Goodbye",
    "pageTitles": {
        "about": "About",
        "resume": "Resume",
        "portfolio": "Portfolio",
        "blog": "Blog",
        "contact": "Contact"
    },
    "pages": {
        "index": {
            "title": "About",
            "textAbout": "I am a front-end developer with experience in maintaining and creating high-fidelity pages, always using the most robust frameworks in the market for testing and development. Additionally, I have experience in customer support.",
            "textAbout2": "I started my career as a Junior Front-End Developer at Convertize, where I used HTML5, CSS3, Django, and Bootstrap to develop and maintain e-commerce pages. I also worked closely with the Support Analyst team, providing phone support and Helpdesk assistance via chat.",
            "textAbout3": "As I progressed in my career, I took on the role of Mid-level Front-End Developer at Convertize. In this role, I was responsible for creating custom landing pages and stores for clients, using HTML5, CSS3, JavaScript, Django, jQuery, Bootstrap, and React.js. I also led the support and resolution of specific Front-End-related issues.",
            "textAbout4": "Most recently, I joined the development team at Cardano Warriors as a Software Engineer (front-end). In the project, I focused on creating highly responsive micro-frontends, following the guidelines set by the UX Designer at Cardano Warriors, using ViteJS, Vue 3, TypeScript, Sass, and VueI18N. Additionally, I actively participated in the creation of our UI library (ui-kit) to consolidate all components and business rules.",
            "textAbout5": "I am constantly seeking to improve my technical skills and stay up-to-date with the latest trends in front-end development. I am passionate about creating attractive interfaces, providing efficient solutions, and contributing to the success of the projects I am involved in.",
            "textAbout6": "I am open to challenging new opportunities where I can apply my experience and knowledge to drive team and company growth.",
            "textAbout7": "Please feel free to contact me to discuss how I can contribute to the success of your organization.",
            "TitleWhatIamDoing": "What I'm Doing?"
        },
        "resume": {
            "title": "Resume",
            "titleEducation": "Education",
            "titleExperience": "Experience",
            "titleSkills": "My skills"
           
        },
        "contact": {
            "title": "Contact",
            "titleContactForm": "Contact Form",
            "placeholderFullName": "Full name",
            "placeholderEmailAdress": "Email address",
            "placeholderYourMessage": "Your Message",
            "buttonSendMessage": "Send Message"
        }
    }
}