{
  "hello": "Hello",
  "goodbye": "Goodbye",
  "pageTitles": {
    "about": "About",
    "resume": "Resume",
    "portfolio": "Portfolio",
    "blog": "Blog",
    "contact": "Contact"
  },
  "notFound": {
    "title": "Page Not Found",
    "textDescription": "The Page you are looking for doesn't exist or an other error occured.",
    "buttonGoBack": "Go back"
  },
  "pages": {
    "index": {
      "title": "About",
      "textAbout": "software developer with 5 years of experience, specialized in Vue.js and familiar with Angular, with a solid foundation in modern web technologies. I’ve worked on large-scale projects, delivering intuitive, responsive, and high-performance interfaces, always aligned with best practices in usability and accessibility. I have experience working in agile environments, collaborating with cross-functional teams where quick adaptation and continuous delivery are essential. I’m proactive, flexible in the face of changing requirements, and quick to learn new technologies when needed.",
      "TitleWhatIamDoing": "What I'm Doing?"
    },
    "resume": {
      "title": "Resume",
      "titleEducation": "Education",
      "educations": [
        {
          "title": "Cruzeiro do Sul Virtual",
          "subTitle": "Higher Education: Systems Analysis and Development",
          "date": "2023 — 2025",
          "description": "This program provides direct exposure to relevant Information Technology topics, with a focus on software development, business management, documentation, and systems."
        },
        {
          "title": "Etec José Martimiano souza",
          "subTitle": "Technical education: Systems Development",
          "date": "2020 — 2021",
          "description": "I developed individual and team projects, applying knowledge in languages such as Java, Object Pascal (Delphi), PHP, JavaScript, and SQL. I learned about the software development life cycle and agile methodologies."
        }
      ],
      "titleExperience": "Experience",
      "experiences": [
        {
          "title": "Senior Front-End Software Engineer - Brazil - Remote",
          "companyAndDate": "Cast Group | 10/2024 - Present",
          "description": "I initially joined Cast Group via Upda Tecnologia and was later internalized due to my strong performance and alignment with the team and projects."
        },
        {
          "title": "Front-End Software Engineer - Brazil - Remote",
          "companyAndDate": "Upda | 06/2023 - 10/2024",
          "description": "As a Vue developer, I continued to use Quasar Vue, Pinia, Vue Router, and TypeScript to create reusable and scalable components."
        },
        {
          "title": "Front-End Software Engineer - Brazil - Remote",
          "companyAndDate": "Cardano Warriors | 02/2022 - 06/2023",
          "description": "I have extensive experience creating responsive microfrontends, with a strong focus on achieving high fidelity to the designs provided by the Cardano Warriors UX Designer. I had the opportunity to work on the development of the new Cardano Warriors platform, where we implemented a microfrontend architecture using Vue 3 with Vitejs, TypeScript, and Sass. During this project, we took the initiative to create a UI library (ui-kit) for component reuse across all microfrontends. This approach enabled greater efficiency and consistency in development, ensuring a unified experience for users."
        },
        {
          "title": "Mid-level Front-End Developer - Ribeirão Preto - SP, Brazil - Remote",
          "companyAndDate": "Convertize | 02/2022 - 11/2022",
          "description": "Developed landing pages and online stores for Convertize's clients, using various technologies including HTML5, CSS3, JavaScript, Django, jQuery, Bootstrap, and React.js. Responsible for providing personalized customer support, solving specific Front-End issues. Managed ticket closure to ensure efficient issue resolution and customer satisfaction."
        },
        {
          "title": "Junior Front-End Developer - Ribeirão Preto - SP, Brazil - Remote",
          "companyAndDate": "Convertize | 05/2021 - 02/2022",
          "description": "I worked on the creation and maintenance of Convertize's e-commerce pages using HTML5, CSS3, Django, and Bootstrap. Collaborated with the Support Analyst team, handling customer queries via phone and Helpdesk chat, providing technical support, and resolving customer issues to ensure an efficient and satisfactory experience."
        }
      ],
      "titleSkills": "My skills",
      "skills": {
        "vue": {
          "description": "Vue is a progressive framework for building user interfaces."
        },
        "angular": {
          "description": "Angular is a platform for building mobile and desktop web applications."
        },
        "nuxt": {
          "description": "Nuxt.js is a framework for building server-rendered Vue applications."
        },
        "javascript": {
          "description": "JavaScript is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions."
        },
        "typescript": {
          "description": "TypeScript is a typed superset of JavaScript that compiles to plain JavaScript."
        },
        "nestjs": {
          "description": "Nest is a framework for building efficient, scalable Node.js server-side applications."
        },
        "spring": {
          "description": "Spring is a framework for building enterprise applications in Java."
        },
        "docker": {
          "description": "Docker is a set of platform as a service products that use OS-level virtualization to deliver software in packages called containers."
        },
        "aws": {
          "description": "Amazon Web Services (AWS) is a subsidiary of Amazon that provides on-demand cloud computing platforms and APIs to individuals, companies, and governments, on a pay-as-you-go basis."
        },
        "git": {
          "description": "Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency."
        },
        "sass": {
          "description": "Sass is a stylesheet language that is compiled to CSS. It allows you to use variables, nested rules, mixins, functions, and more, all with a fully CSS-compatible syntax."
        },
        "linux": {
          "description": "Linux is a family of open-source Unix-like operating systems based on the Linux kernel, an operating system kernel first released on September 17, 1991."
        }
      }
    },
    "contact": {
      "title": "Contact",
      "titleContactForm": "Contact Form",
      "placeholderFullName": "Full name",
      "placeholderEmailAdress": "Email address",
      "placeholderYourMessage": "Your Message",
      "buttonSendMessage": "Send Message"
    },
    "portfolio": {
      "title": "Portfolio",
      "buttonAll": "All"
    }
  }
}
