{
    "hello": "Hello",
    "goodbye": "Goodbye",
    "pageTitles": {
        "about": "About",
        "resume": "Resume",
        "portfolio": "Portfolio",
        "blog": "Blog",
        "contact": "Contact"
    },
    "notFound": {
        "title": "Page Not Found",
        "textDescription": "The Page you are looking for doesn't exist or an other error occured.",
        "buttonGoBack": "Go back"
    },
    "pages": {
        "index": {
            "title": "About",
            "textAbout": "software developer with 5 years of experience, specialized in Vue.js and familiar with Angular, with a solid foundation in modern web technologies. I’ve worked on large-scale projects, delivering intuitive, responsive, and high-performance interfaces, always aligned with best practices in usability and accessibility. I have experience working in agile environments, collaborating with cross-functional teams where quick adaptation and continuous delivery are essential. I’m proactive, flexible in the face of changing requirements, and quick to learn new technologies when needed.",
            "TitleWhatIamDoing": "What I'm Doing?"
        },
        "resume": {
            "title": "Resume",
            "titleEducation": "Education",
            "titleExperience": "Experience",
            "titleSkills": "My skills",
            "skills": {
                "vue": {
                    "description": "Vue is a progressive framework for building user interfaces."
                },
                "angular": {
                    "description": "Angular is a platform for building mobile and desktop web applications."
                },
                "nuxt": {
                    "description": "Nuxt.js is a framework for building server-rendered Vue applications."
                },
                "javascript": {
                    "description": "JavaScript is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions."
                },
                "typescript": {
                    "description": "TypeScript is a typed superset of JavaScript that compiles to plain JavaScript."
                },
                "nestjs": {
                    "description": "Nest is a framework for building efficient, scalable Node.js server-side applications."
                },
                "spring": {
                    "description": "Spring is a framework for building enterprise applications in Java."
                },
                "docker": {
                    "description": "Docker is a set of platform as a service products that use OS-level virtualization to deliver software in packages called containers."
                },
                "aws": {
                    "description": "Amazon Web Services (AWS) is a subsidiary of Amazon that provides on-demand cloud computing platforms and APIs to individuals, companies, and governments, on a pay-as-you-go basis."
                },
                "git": {
                    "description": "Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency."
                },
                "sass": {
                    "description": "Sass is a stylesheet language that is compiled to CSS. It allows you to use variables, nested rules, mixins, functions, and more, all with a fully CSS-compatible syntax."
                },
                "linux": {
                    "description": "Linux is a family of open-source Unix-like operating systems based on the Linux kernel, an operating system kernel first released on September 17, 1991."
                }
            }
        },
        "contact": {
            "title": "Contact",
            "titleContactForm": "Contact Form",
            "placeholderFullName": "Full name",
            "placeholderEmailAdress": "Email address",
            "placeholderYourMessage": "Your Message",
            "buttonSendMessage": "Send Message"
        },
        "portfolio": {
            "title": "Portfolio",
            "buttonAll": "All"
        }
    }
}
