{
    "hello": "Olá",
    "goodbye": "Tchau",
    "pageTitles": {
        "about": "Sobre",
        "resume": "Currículo",
        "portfolio": "Portfólio",
        "blog": "Blog",
        "contact": "Contato"
    },
    "notFound": {
        "title": "Página não encontrada",
        "textDescription": "A página que você está procurando não existe ou ocorreu algum outro erro.",
        "buttonGoBack": "Voltar"
    },
    "pages": {
        "index": {
            "title": "Sobre",
            "textAbout": "Desenvolvedor de software com 5 anos de experiência, especializado em Vue.js e com conhecimento em Angular, além de sólidos fundamentos em tecnologias web modernas. Participei de projetos de grande porte, entregando interfaces intuitivas, responsivas e de alta performance, sempre alinhadas às melhores práticas de usabilidade e acessibilidade. Tenho experiência em ambientes ágeis, colaborando com times multidisciplinares, onde adaptação rápida e entrega contínua são essenciais. Sou proativo, flexível diante de mudanças de escopo e aprendo novas tecnologias com rapidez sempre que necessário.",
            "TitleWhatIamDoing": "O que estou fazendo?"
        },
        "resume": {
            "title": "Currículo",
            "titleEducation": "Formação",
            "titleExperience": "Experiência",
            "titleSkills": "Minhas habilidades",
            "skills": {
                "vue": {
                    "description": "Vue é um framework progressivo para construir interfaces de usuário."
                },
                "angular": {
                    "description": "Angular é uma plataforma para construir aplicações web para desktop e mobile."
                },
                "nuxt": {
                    "description": "Nuxt.js é um framework para criar aplicações Vue renderizadas no lado do servidor."
                },
                "javascript": {
                    "description": "JavaScript é uma linguagem de programação leve, interpretada ou compilada just-in-time, com funções de primeira classe."
                },
                "typescript": {
                    "description": "TypeScript é um superset de JavaScript tipado que compila para JavaScript puro."
                },
                "nestjs": {
                    "description": "Nest é um framework para construir aplicações eficientes e escaláveis no lado do servidor com Node.js."
                },
                "spring": {
                    "description": "Spring é um framework para construir aplicações corporativas em Java."
                },
                "docker": {
                    "description": "Docker é um conjunto de produtos de plataforma como serviço que usam virtualização em nível de sistema operacional para entregar softwares em contêineres."
                },
                "aws": {
                    "description": "Amazon Web Services (AWS) é uma subsidiária da Amazon que fornece plataformas de computação em nuvem e APIs sob demanda para indivíduos, empresas e governos sob o modelo de pagamento conforme o uso."
                },
                "git": {
                    "description": "Git é um sistema de controle de versão distribuído gratuito e de código aberto, projetado para lidar com tudo, desde pequenos até muito grandes projetos, com velocidade e eficiência."
                },
                "sass": {
                    "description": "Sass é uma linguagem de folhas de estilo que é compilada para CSS. Permite usar variáveis, regras aninhadas, mixins, funções e mais, tudo com uma sintaxe totalmente compatível com CSS."
                },
                "linux": {
                    "description": "Linux é uma família de sistemas operacionais de código aberto semelhantes ao Unix, baseada no kernel Linux, lançado pela primeira vez em 17 de setembro de 1991."
                }
            }
        },
        "contact": {
            "title": "Contato",
            "titleContactForm": "Formulário de Contato",
            "placeholderFullName": "Nome completo",
            "placeholderEmailAdress": "Endereço de e-mail",
            "placeholderYourMessage": "Sua mensagem",
            "buttonSendMessage": "Enviar mensagem"
        },
        "portfolio": {
            "title": "Portfólio",
            "buttonAll": "Todos"
        }
    }
}
